; domain
;; Domain definition
(define (domain travel-domain)
  
  ;; Predicates: Properties of objects that we are interested in (boolean)
  (:predicates
    (AIRPORT ?x) ; True if x is an airport
    (STATION ?x) ; True if x is a station
    (PERSON ?x) ; True if x is a person
    (VEHICLE ?x) ; True if x is a method of transportation
    (AIRPLANE ?x) ; True if x is an airplane
    (SUBWAY ?x) ; True if x is a subway
    (connected ?x ?y) ; True if airport/station x is connected to airport/station y
    (is-person-at ?x ?y) ; True if person x is at airport/station y
    (is-vehicle-at ?x ?y) ; True if vehicle x is at airport/station y
    (is-person-in-vehicle ?x ?y) ; True if person x is in vehicle y
  )
  ;; Actions: Ways of changing the state of the world
  
  ; Person x enters vehicle y if both are in the same airport/station z.
  ; As a result, person x is in vehicle y and not at z anymore.
  ; Parameters
  ; - x: person
  ; - y: vehicle
  ; - z: station
  (:action enter-vehicle
    :parameters (?x ?y ?z)
    :precondition (and 
        (PERSON ?x) 
        (VEHICLE ?y) 
        (or (STATION ?z) (AIRPORT ?z))
        (is-person-at ?x ?z) 
        (is-vehicle-at ?y ?z)
    )
    :effect (and 
        (is-person-in-vehicle ?x ?y)
        (not (is-person-at ?x ?z))
    )
  )
  
  ; Person x leaves vehicle y in airport/station z if the person x is in the 
  ; vehicle y and the vehicle y is at z.
  ; As a result, person x is not in vehicle y anymore and the person x is at z
  ; Parameters
  ; - x: person
  ; - y: vehicle
  ; - z: station
  (:action leave-vehicle
    :parameters (?x ?y ?z)
    :precondition (and 
        (PERSON ?x) 
        (VEHICLE ?y) 
        (or (STATION ?z) (AIRPORT ?z))
        (is-vehicle-at ?y ?z)
        (is-person-in-vehicle ?x ?y)
    )
    :effect (and 
        (not (is-person-in-vehicle ?x ?y))
        (is-person-at ?x ?z)
    )
  )

  ; Long-distance travel, i.e. between airports x and y by an 
  ; airplane z if x and y are connected.
  ; As a result, vehicle z is at y, and not at x anymore.
  ; Parameters
  ; - x: airport from
  ; - y: airport to
  ; - z: airplane
  (:action travel-long
    :parameters (?x ?y ?z)
    :precondition (and 
        (AIRPORT ?x) 
        (AIRPORT ?y)
        (AIRPLANE ?z)
        (is-vehicle-at ?z ?x)
        (connected ?x ?y)
    )
    :effect (and 
        (not (is-vehicle-at ?z ?x)) 
        (is-vehicle-at ?z ?y)
    )
  )

  ; Short-distance travel, i.e. not between airports, by a 
  ; subsway train z if x and y are connected.
  ; As a result, vehicle z is at y, and not at x anymore.
  ; Parameters
  ; - x: airport/station from
  ; - y: airport/station to
  ; - z: subway
  (:action travel-short
    :parameters (?x ?y ?z)
    :precondition (and 
        (not (and (AIRPORT ?x) (AIRPORT ?y)))
        (SUBWAY ?z)
        (is-vehicle-at ?z ?x)
        (connected ?x ?y)
    )
    :effect (and 
        (not (is-vehicle-at ?z ?x)) 
        (is-vehicle-at ?z ?y)
    )
  )
  
  
)

; problem
;; Problem definition
(define (problem problem-1)

  ;; Specifying the domain for the problem
  (:domain travel-domain)

  ;; Objects definition
  (:objects
    ; airports
    AP1
    AP2
    ; stations
    S11
    S12
    S21
    S22
    ; Persons
    person
    ; Vehicles
    plane
    train1
    train2
  )

  ;; Intial state of problem 1
  (:init
    ;; Declaration of the objects
    ; We initialize the airports
    (AIRPORT AP1)
    (AIRPORT AP2)
    ; stations
    (STATION S11)
    (STATION S12)
    (STATION S21)
    (STATION S22)
    ; Persons
    (PERSON person)
    ; Vehicles
    (VEHICLE plane)
    (VEHICLE train1)
    (VEHICLE train2)
    (AIRPLANE plane)
    (SUBWAY train1)
    (SUBWAY train2)
    ; Links
    (connected AP1 AP2) (connected AP2 AP1)
    (connected S11 S12) (connected S12 S11) 
    (connected AP1 S11) (connected S11 AP1)
    (connected AP1 S12) (connected S12 AP1)
    (connected S21 S22) (connected S22 S21) 
    (connected AP2 S21) (connected S21 AP2)
    (connected AP2 S22) (connected S22 AP2)
    
    ;; Declaration of the predicates of the objects
    ; We set vehicles locations
    (is-vehicle-at plane AP2)
    (is-vehicle-at train1 AP1)
    (is-vehicle-at train2 AP2)
    ; We set the person initial position
    (is-person-at person S11)
  )

  ;; Goal specification
  (:goal
    (and
      ; We want person at S22
      (is-person-at person S22)
    )
  )

)

; plan
1. (travel-short ap2 s22 train2)
   deleted: (is-vehicle-at train2 ap2)
   added: (is-vehicle-at train2 s22)
   goals met: 0 of 1
2. (travel-short ap1 s11 train1)
   deleted: (is-vehicle-at train1 ap1)
   added: (is-vehicle-at train1 s11)
   goals met: 0 of 1
3. (travel-long ap2 ap1 plane)
   deleted: (is-vehicle-at plane ap2)
   added: (is-vehicle-at plane ap1)
   goals met: 0 of 1
4. (enter-vehicle person train1 s11)
   deleted: (is-person-at person s11)
   added: (is-person-in-vehicle person train1)
   goals met: 0 of 1
5. (travel-short s11 ap1 train1)
   deleted: (is-vehicle-at train1 s11)
   added: (is-vehicle-at train1 ap1)
   goals met: 0 of 1
6. (leave-vehicle person train1 ap1)
   deleted: (is-person-in-vehicle person train1)
   added: (is-person-at person ap1)
   goals met: 0 of 1
7. (enter-vehicle person plane ap1)
   deleted: (is-person-at person ap1)
   added: (is-person-in-vehicle person plane)
   goals met: 0 of 1
8. (travel-long ap1 ap2 plane)
   deleted: (is-vehicle-at plane ap1)
   added: (is-vehicle-at plane ap2)
   goals met: 0 of 1
9. (leave-vehicle person plane ap2)
   deleted: (is-person-in-vehicle person plane)
   added: (is-person-at person ap2)
   goals met: 0 of 1
10. (travel-short s22 ap2 train2)
   deleted: (is-vehicle-at train2 s22)
   added: (is-vehicle-at train2 ap2)
   goals met: 0 of 1
11. (enter-vehicle person train2 ap2)
   deleted: (is-person-at person ap2)
   added: (is-person-in-vehicle person train2)
   goals met: 0 of 1
12. (travel-short ap2 s22 train2)
   deleted: (is-vehicle-at train2 ap2)
   added: (is-vehicle-at train2 s22)
   goals met: 0 of 1
13. (leave-vehicle person train2 s22)
   deleted: (is-person-in-vehicle person train2)
   added: (is-person-at person s22)
   goals met: 1 of 1
